In [4]:
import pandas as pd

In [5]:
data = pd.read_csv('data/data.csv', parse_dates=True)

In [6]:
data

       Date Class  Id  Value
0  20170101     A   1   10.0
1  20170101     B   2   50.0
2  20170101     C   3  100.0
3  20170102     A   1   11.0
4  20170102     B   2   49.0
5  20170102     C   3  101.0
6  20170103     A   1    9.0
7  20170103     B   2   53.0
8  20170103     C   3  102.0
9  20170103     C   4  102.0

In [7]:
filtered = data.query('Date>20170101 & Date<=20170103')

In [8]:
filtered

       Date Class  Id  Value
3  20170102     A   1   11.0
4  20170102     B   2   49.0
5  20170102     C   3  101.0
6  20170103     A   1    9.0
7  20170103     B   2   53.0
8  20170103     C   3  102.0
9  20170103     C   4  102.0

In [9]:
grouped = filtered.groupby(by=['Date','Class'], as_index=False)['Value'].sum()

In [10]:
grouped

       Date Class  Value
0  20170102     A   11.0
1  20170102     B   49.0
2  20170102     C  101.0
3  20170103     A    9.0
4  20170103     B   53.0
5  20170103     C  204.0

In [11]:
pivot = grouped.pivot(index='Date', columns='Class', values='Value')

In [12]:
pivot

Class        A     B      C
Date
20170102  11.0  49.0  101.0
20170103   9.0  53.0  204.0

In [13]:
pivot.std()

Class
A     1.414214
B     2.828427
C    72.831998
dtype: float64

In [14]:
grouped.sort_values(['Value'],ascending=0)

       Date Class  Value
5  20170103     C  204.0
2  20170102     C  101.0
4  20170103     B   53.0
1  20170102     B   49.0
0  20170102     A   11.0
3  20170103     A    9.0

In [15]:
pivot.transpose()

Date   20170102  20170103
Class
A          11.0       9.0
B          49.0      53.0
C         101.0     204.0